## Production: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 13 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.redis_batch_saving will be created
  + resource "aws_cloudwatch_dashboard" "redis_batch_saving" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "NotificationCanadaCa",
                                  + "batch_saving_published",
                                  + "list_name",
                                  + "inbox:email:priority",
                                ],
                              + [
                                  + "...",
                                  + "inbox:email:normal",
                                ],
                              + [
                                  + "...",
                                  + "inbox:email:bulk",
                                ],
                            ]
                          + period  = 300
                          + region  = "ca-central-1"
                          + stacked = false
                          + stat    = "Sum"
                          + title   = "Added to email inboxes"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 9
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "NotificationCanadaCa",
                                  + "batch_saving_published",
                                  + "list_name",
                                  + "inbox:sms:priority",
                                ],
                              + [
                                  + "...",
                                  + "inbox:sms:normal",
                                ],
                              + [
                                  + "...",
                                  + "inbox:sms:bulk",
                                ],
                            ]
                          + period  = 300
                          + region  = "ca-central-1"
                          + stacked = false
                          + stat    = "Sum"
                          + title   = "Added to sms inboxes"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 9
                      + x          = 9
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "NotificationCanadaCa",
                                  + "batch_saving_inflight",
                                  + "notification_type",
                                  + "email",
                                  + "created",
                                  + "True",
                                  + "priority",
                                  + "priority",
                                  + {
                                      + label = "created"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "acknowledged",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "acknowledged"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "expired",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "expired"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "ca-central-1"
                          + stacked = false
                          + stat    = "Sum"
                          + title   = "Priority email inflights"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 0
                      + y          = 6
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "NotificationCanadaCa",
                                  + "batch_saving_inflight",
                                  + "notification_type",
                                  + "email",
                                  + "created",
                                  + "True",
                                  + "priority",
                                  + "normal",
                                  + {
                                      + label = "created"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "acknowledged",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "acknowledged"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "expired",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "expired"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "ca-central-1"
                          + stacked = false
                          + stat    = "Sum"
                          + title   = "Normal email inflights"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 6
                      + y          = 6
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "NotificationCanadaCa",
                                  + "batch_saving_inflight",
                                  + "notification_type",
                                  + "email",
                                  + "created",
                                  + "True",
                                  + "priority",
                                  + "bulk",
                                  + {
                                      + label = "created"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "acknowledged",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "acknowledged"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "expired",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "expired"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "ca-central-1"
                          + stacked = false
                          + stat    = "Sum"
                          + title   = "Bulk email inflights"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 12
                      + y          = 6
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "NotificationCanadaCa",
                                  + "batch_saving_inflight",
                                  + "notification_type",
                                  + "sms",
                                  + "created",
                                  + "True",
                                  + "priority",
                                  + "priority",
                                  + {
                                      + label = "created"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "acknowledged",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "acknowledged"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "expired",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "expired"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "ca-central-1"
                          + stacked = false
                          + stat    = "Sum"
                          + title   = "Priority sms inflights"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 0
                      + y          = 12
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "NotificationCanadaCa",
                                  + "batch_saving_inflight",
                                  + "notification_type",
                                  + "sms",
                                  + "created",
                                  + "True",
                                  + "priority",
                                  + "normal",
                                  + {
                                      + label = "created"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "acknowledged",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "acknowledged"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "expired",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "expired"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "ca-central-1"
                          + stacked = false
                          + stat    = "Sum"
                          + title   = "Normal sms inflights"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 6
                      + y          = 12
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "NotificationCanadaCa",
                                  + "batch_saving_inflight",
                                  + "notification_type",
                                  + "sms",
                                  + "created",
                                  + "True",
                                  + "priority",
                                  + "bulk",
                                  + {
                                      + label = "created"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "acknowledged",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "acknowledged"
                                    },
                                ],
                              + [
                                  + "...",
                                  + "expired",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + label = "expired"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "ca-central-1"
                          + stacked = false
                          + stat    = "Sum"
                          + title   = "Bulk sms inflights"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 12
                      + y          = 12
                    },
                ]
            }
        )
      + dashboard_name = "Redis-batch-saving"
      + id             = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "bulk-bulk-not-being-processed-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "Bulk bulk saving are being created but are not being processed fast enough. Difference > 10000 for 5 minutes"
      + alarm_name                            = "bulk_bulk-buffer-not-being-processed-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 10000
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "bulk_created"
          + label       = "Bulk created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created"  = "True"
                  + "priority" = "bulk"
                }
              + metric_name = "batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "bulk_processed"
          + label       = "Bulk processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                  + "priority"     = "bulk"
                }
              + metric_name = "batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(bulk_created - bulk_processed)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "bulk-bulk-not-being-processed-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Bulk bulk saving are being created but are not being processed fast enough. Difference > 5000 for 5 minutes"
      + alarm_name                            = "bulk-bulk-buffer-not-being-processed-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 5000
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "bulk_created"
          + label       = "Bulk created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created"  = "True"
                  + "priority" = "bulk"
                }
              + metric_name = "batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "bulk_processed"
          + label       = "Bulk processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                  + "priority"     = "bulk"
                }
              + metric_name = "batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(bulk_created - bulk_processed)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "bulk-inflights-not-being-processed-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "Batch saving bulk inflights are being created but are not being processed fast enough. Difference > 200 for 5 minutes"
      + alarm_name                            = "bulk-inflights-not-being-processed-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 200
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "inflight_created"
          + label       = "Inflight created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created"  = "True"
                  + "priority" = "bulk"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "inflight_processed"
          + label       = "Inflight processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                  + "priority"     = "bulk"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(inflight_created - inflight_processed)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "bulk-inflights-not-being-processed-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Batch saving bulk inflights are being created but are not being processed fast enough. Difference > 100 for 5 minutes"
      + alarm_name                            = "bulk-inflights-not-being-processed-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "inflight_created"
          + label       = "Inflight created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created"  = "True"
                  + "priority" = "bulk"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "inflight_processed"
          + label       = "Inflight processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                  + "priority"     = "bulk"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(inflight_created - inflight_processed)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "bulk-not-being-processed-critical" {
      ~ alarm_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        id                        = "bulk-buffer-not-being-processed-critical"
        tags                      = {}
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.inflights-not-being-processed-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "inflights-not-being-processed-critical" {
      ~ alarm_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        id                        = "inflights-not-being-processed-critical"
        tags                      = {}
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.normal-bulk-not-being-processed-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "normal-bulk-not-being-processed-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "Normal bulk saving are being created but are not being processed fast enough. Difference > 10000 for 5 minutes"
      + alarm_name                            = "normal_bulk-buffer-not-being-processed-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 10000
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "bulk_created"
          + label       = "Bulk created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created"  = "True"
                  + "priority" = "normal"
                }
              + metric_name = "batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "bulk_processed"
          + label       = "Bulk processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                  + "priority"     = "normal"
                }
              + metric_name = "batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(bulk_created - bulk_processed)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.normal-bulk-not-being-processed-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "normal-bulk-not-being-processed-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "Normal bulk saving are being created but are not being processed fast enough. Difference > 5000 for 5 minutes"
      + alarm_name     ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
